import { Item } from "@/types/Item";

export const ITEMS: Item[] = [
    {
        id: 1,
        url: '/images/item1.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 2,
        url: '/images/item2.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 3,
        url: '/images/item3.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 4,
        url: '/images/item4.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 5,
        url: '/images/item5.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 6,
        url: '/images/item6.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 7,
        url: '/images/item7.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 8,
        url: '/images/item8.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 9,
        url: '/images/item9.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 10,
        url: '/images/item10.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 11,
        url: '/images/item11.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 12,
        url: '/images/item12.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 13,
        url: '/images/item13.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 14,
        url: '/images/item14.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 15,
        url: '/images/item15.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
    {
        id: 16,
        url: '/images/item16.jpg',
        title: 'テキストテキストテキストテキスト',
        price: 99999,
        texts: [
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト',
            'テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト'
        ],
        size: {
            width: 999,
            depth: 999,
            height: 999,
        },
        color: 'テキスト',
        material: 'テキストテキストテキストテキスト',
    },
];